# IsPenColorByClass

## Description
Function IsPenColorByClass returns whether class pen colors are used for the referenced object.

```pascal
FUNCTION IsPenColorByClass(h : HANDLE) : BOOLEAN;
```

```python

def vs.IsPenColorByClass(h):
    return BOOLEAN
```

## Parameters
|Name|Type|Description|
|---|---|---|
|h|HANDLE|Handle to object.|

## Remarks
Returns an indication of whether the class pen colors are used for the object referenced by h.<BR>
<BR>
[sd 8/19/98]

## Version
Availability: from VectorWorks8.0
## Category
* Object Attributes